README.tex
% Created 2016-05-03 Tue 11:51
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{AnderSon}
\date{Tue May  3 10:45:24 CDT 2016}
\title{\textbf{Iron Brush Tattoo} \emph{Case Jewelry}}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

\emph{Rails 4.2.6}

\url{https://github.com/IronBrushTattoo/cj_rails.git}

\section{Files}
\label{sec-1}

\subsection{Gemfile}
\label{sec-1-1}

\url{./Gemfile}

\begin{verbatim}
source 'https://rubygems.org'

gem 'rails', '4.2.6'
gem 'pg', '~> 0.15'
gem 'sass-rails', '~> 5.0'
gem 'uglifier', '>= 1.3.0'
gem 'coffee-rails', '~> 4.1.0'
gem 'jquery-rails'
gem 'turbolinks'
gem 'jbuilder', '~> 2.0'
gem 'sdoc', '~> 0.4.0', group: :doc

group :development, :test do
  gem 'byebug'
end

group :development do
  gem 'web-console', '~> 2.0'
  gem 'spring'
end
\end{verbatim}




\subsection{database.yml}
\label{sec-1-2}

\url{./config/database.yml}

\section{First steps}
\label{sec-2}

\begin{verbatim}
rake db:migrate
rake db:setup
\end{verbatim}
\section{Project}
\label{sec-3}

The purpose of this application is produce several pdf files from an xlsx file,
as a re-implementation of \url{https://github.com/IronBrushTattoo/cj} as a web 
application.

\subsection{User Story}
\label{sec-3-1}

\begin{itemize}
\item user logs in
\item chooses xlsx file for upload
\item selects number of days back to make labels from
\item submits
\begin{itemize}
\item BACKGROUND
\begin{itemize}
\item cj-parser.rb does what it does\ldots{}
\begin{itemize}
\item $\square$ rewrite in rails?
\end{itemize}
\end{itemize}
\end{itemize}
\item downloads sheets(pdf files)
\end{itemize}

\subsection{Views}
\label{sec-3-2}

\subsubsection{Routes}
\label{sec-3-2-1}

\url{./config/routes.rb}

\begin{verbatim}
Rails.application.routes.draw do
  root 'pages#home'

  # The priority is based upon order of creation: first created -> highest priority.
  # See how all your routes lay out with "rake routes".

  # You can have the root of your site routed with "root"
  # root 'welcome#index'

  # Example of regular route:
  #   get 'products/:id' => 'catalog#view'

  # Example of named route that can be invoked with purchase_url(id: product.id)
  #   get 'products/:id/purchase' => 'catalog#purchase', as: :purchase

  # Example resource route (maps HTTP verbs to controller actions automatically):
  #   resources :products

  # Example resource route with options:
  #   resources :products do
  #     member do
  #       get 'short'
  #       post 'toggle'
  #     end
  #
  #     collection do
  #       get 'sold'
  #     end
  #   end

  # Example resource route with sub-resources:
  #   resources :products do
  #     resources :comments, :sales
  #     resource :seller
  #   end

  # Example resource route with more complex sub-resources:
  #   resources :products do
  #     resources :comments
  #     resources :sales do
  #       get 'recent', on: :collection
  #     end
  #   end

  # Example resource route with concerns:
  #   concern :toggleable do
  #     post 'toggle'
  #   end
  #   resources :posts, concerns: :toggleable
  #   resources :photos, concerns: :toggleable

  # Example resource route within a namespace:
  #   namespace :admin do
  #     # Directs /admin/products/* to Admin::ProductsController
  #     # (app/controllers/admin/products_controller.rb)
  #     resources :products
  #   end
end
\end{verbatim}

\subsubsection{Static Pages}
\label{sec-3-2-2}

\begin{verbatim}
root 'pages#home'    
\end{verbatim}

\ref{sec-3-3-1}

\begin{enumerate}
\item Home
\label{sec-3-2-2-1}

\url{./app/views/pages/home.html.erb}
\end{enumerate}

\subsection{Controllers}
\label{sec-3-3}

\subsubsection{Pages}
\label{sec-3-3-1}

Static pages controller

\begin{verbatim}
rails g controller pages --skip-assets
\end{verbatim}

\subsection{{\bfseries\sffamily TODO} }
\label{sec-3-4}

\begin{itemize}
\item $\square$ user authentication
\item $\square$ file upload
\begin{itemize}
\item $\square$ only xlsx file?
\end{itemize}
\item $\square$ file storage
\begin{itemize}
\item $\square$ archival api?
\end{itemize}
\item $\square$ 
\end{itemize}
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}
